#pragma once

//パチモンの構造体を定義
struct POKEMON {
	int No = -1;					//図鑑No.
	char Name[50];					//名前
	char Type1[20];					//タイプ1
	char Type2[20];					//タイプ2
	int H = 0;						//HP
	int A = 0;						//こうげき
	int B = 0;						//ぼうぎょ
	int C = 0;						//とくこう
	int D = 0;						//とくぼう
	int S = 0;						//すばやさ
	int Tec[4] = { -1,-1,-1,-1 };	//所持技格納変数

};

struct POK {
	POKEMON Sel[3];		//手持ち3匹のモンスター変数
	POKEMON Out;		//今バトル場に出てるモンスター変数
};
POK Pla;				//プレイヤー側の構造体
POK Ene;				//相手側の構造体

POKEMON Pokemon[40] = {
	{0,"マグリュウ","炎","",
	39,52,43,60,50,65,
	0,0,0,0},
	{1,"テツマグドン","炎","鋼",
	58,64,58,80,65,80,
	0,0,0,0},
	{2,"イグラドガネ","炎","鋼",
	78,84,78,109,85,100,
	0,0,0,0},
	{4,"カッチー","水","",
	40,48,65,50,64,43,
	0,0,0,0},
	{5,"カチコッチ","水","氷",
	65,63,85,65,80,58,
	0,0,0,0},
	{6,"コオリノヤリ","水","氷",
	75,83,60,85,100,100,
	0,0,0,0},
};