#pragma once

struct TECNIQUE
{
	int No = -1;		//技の番号
	char name[50];		//技の名前
	char Type[20];		//技のタイプ
	int A = 0;			//技のこうげき
	int C = 0;			//技のとくこう
	int Rate = 0;		//技の命中率
};

TECNIQUE Tecnique[] = {
	//ノーマル技
	{0,"たいあたり","普",40,0,100},
	{1,"ひっかく","普",40,0,100},
	{2,"はたく","普",40,0,100},
	{3,"きりさく","普",70,0,100},
	{4,"つのでつく","普",65,0,100},
	{5,"はさむ","普",55,0,100},
	{6,"はかいこうせん","普",150,0,90},
	{7,"たたきつける","普",80,0,75},
	{8,"でんこうせっか","普",40,0,100},
	{9,"メガトンパンチ","普",80,0,85},
	{10,"メガトンキック","普",120,0,75},
	{11,"かいりき","普",80,0,100},
	{12,"はねる","普",0,0,100},
	{13,"とっしん","普",90,0,85},
	//くさ技
	{14,"はっぱかったー","草",0,50,100},
	{15,"ギガドレイン","草",0,80,100},
	{16,"リーフブレード","草",90,0,100},
	//みず技
	{17,"みずでっぽう","水",0,40,100},
	{18,"アクアブレイク","水",0,85,100},
	{19,"ハイドロポンプ","水",0,120,80},
	//ほのお技
	{20,"ひのこ","火",0,40,100},
	{21,"かえんほうしゃ","火",0,90,90},
	{22,"だいもんじ","火",0,120,80},
	{23,"ニトロチャージ","火",50,0,100},
	{24,"ねっぷう","火",0,95,90},
	//はがね技
	{25,"きょじゅうざん","鋼",100,0,100},
	{26,"きょじゅうだん","鋼",100,0,100},
	{27,"アイアンテール","鋼",100,0,75},
	{28,"アイアンヘッド","鋼",80,0,100},
	{29,"はがねのつばさ","鋼",70,0,90},
	//こおり技
	{30,"れいとうビーム","氷",0,90,100},
	{31,"れいとうパンチ","氷",75,0,100},
	{32,"こおりのキバ","氷",65,0,95},
	{33,"ふぶき","氷",0,110,70},
	// エスパー技
	{34,"サイコカッター","催",70,0,100},
	{35,"サイコファング","催",85,0,100},
	{36,"サイコブレイド","催",80,0,100},
	{37,"プリズムレーザー","催",0,160,100},
	// あく技
	{38,"かみつく","悪",60,0,100},
	{39,"かみくだく","悪",80,0,100},
	{40,"つじぎり","悪",70,0,100},
};
