#pragma once
#include <string>

using namespace std;

struct TECNIQUE
{
	int No = -1;		//技の番号
	string name;		//技の名前
	string Type;		//技のタイプ
	int A = 0;			//技のこうげき
	int C = 0;			//技のとくこう
	int Rate = 0;		//技の命中率
};

TECNIQUE Tecnique[] = {
	//ノーマル技
	{0,"たいあたり","普",40,0,100},
	{1,"ひっかく","普",40,0,100},
	{2,"はたく","普",40,0,100},
	//くさ技
	{3,"はっぱかったー","草",0,50,100},
	{4,"ギガドレイン","草",0,80,100},
	{5,"リーフブレード","草",90,0,100},
	//みず技
	{6,"みずでっぽう","水",0,40,100},
	{7,"アクアブレイク","水",0,85,100},
	{8,"ハイドロポンプ","水",0,120,80},
	//ほのお技
	{9,"ひのこ","火",0,40,100},
	{10,"かえんほうしゃ","火",0,90,90},
	{11,"だいもんじ","火",0,120,80},
	//はがね技
};
