#pragma once

struct TECNIQUE
{
	int No = -1;		//技の番号
	char name[50];		//技の名前
	char Type[20];		//技のタイプ
	int A = 0;			//技のこうげき
	int C = 0;			//技のとくこう
	int Rate = 0;		//技の命中率
};

TECNIQUE Tecnique[] = {
	//ノーマル技
	{0,"たいあたり","普",40,0,100},
	{1,"ひっかく","普",40,0,100},
	{2,"はたく","普",40,0,100},
	{3,"きりさく","普",70,0,100},
	{4,"つのでつく","普",65,0,100},
	{5,"はさむ","普",55,0,100},
	//くさ技
	{6,"はっぱかったー","草",0,50,100},
	{7,"ギガドレイン","草",0,80,100},
	{8,"リーフブレード","草",90,0,100},
	//みず技
	{9,"みずでっぽう","水",0,40,100},
	{10,"アクアブレイク","水",0,85,100},
	{11,"ハイドロポンプ","水",0,120,80},
	//ほのお技
	{12,"ひのこ","火",0,40,100},
	{13,"かえんほうしゃ","火",0,90,90},
	{14,"だいもんじ","火",0,120,80},
	{15,"ニトロチャージ","火",50,0,100},
	{16,"ねっぷう","火",0,95,90},
	//はがね技
	{17,"きょじゅうざん","鋼",100,0,100},
};
